rails-intro/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG') ORDER BY rating
---
  def index
    if params[:sort] != session[:sort] || params[:ratings] != session[:ratings]
      session[:sort] = params[:sort] if params[:sort]
      session[:ratings] = params[:ratings] if params[:ratings]
      redirect_to movies_path :sort => session[:sort], :ratings => session[:ratings]
    end
    @all_ratings = Movie.ratings
    @desired_ratings = @all_ratings
    if params[:ratings] != nil
      @desired_ratings = params[:ratings].keys
    end
    @movies = Movie.find :all, :order => params[:sort], :conditions => {:rating => @desired_ratings}